NurPech/Hannah/satellite-esp/sdkconfig.defaults
# Hannah Satellite — gemeinsame Defaults (alle Targets)
# Board-spezifische Overrides:
#   sdkconfig.defaults.devkit  — ESP32-S3 DevKitC-1 (Breadboard, INMP441)
#   sdkconfig.defaults.rev3    — Hannah Satellite PCB Rev.3
#
# Build-Befehle:
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.devkit" build
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.rev3"   build
#
# Gerätespezifische Werte (SSID, Passwort, Device-ID) in sdkconfig.local setzen.
# sdkconfig.local und sdkconfig sind in .gitignore.

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash & PSRAM (ESP32-S3-WROOM-1-N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# mbedTLS: asymmetrische TLS-Buffer — IN 8KB / OUT 4KB statt 16KB/16KB spart internen RAM
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# RSA-Key-Exchange deaktivieren (kein Forward Secrecy) — erzwingt ECDHE
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=n
# mbedTLS-Allokationen in PSRAM statt im knappen internen DRAM (Refs #188 —
# CONFIG_MBEDTLS_PLATFORM_MEMORY war hier vorher gesetzt, existiert aber gar
# nicht als Kconfig-Option und war ein stiller No-Op; das ist die tatsächlich
# wirksame Option dafür)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Hardware-AES deaktivieren (Refs #192): die AES-DMA-Engine allokiert ihre
# Deskriptoren/Alignment-Buffer selbst, direkt mit MALLOC_CAP_DMA|
# MALLOC_CAP_INTERNAL (esp_aes_dma_core.c) — komplett vorbei an
# mbedtls_platform_set_calloc_free() oben, DMA-fähiger Speicher für die
# Krypto-Hardware muss zwingend intern liegen und lässt sich nicht per
# Policy auf PSRAM umbiegen. Software-AES läuft dagegen über den normalen,
# PSRAM-fähigen Allocator. Laut ESP-IDF-Doku bringt Hardware-AES bei
# 240MHz CPU-Takt ohnehin keinen Geschwindigkeitsvorteil — für die
# gelegentliche OTA-/Asset-HTTPS-Nutzung hier kein relevanter Tradeoff.
CONFIG_MBEDTLS_HARDWARE_AES=n

# PSRAM als malloc()-Default statt Ausnahme: nur echte Realtime-/DMA-/ISR-
# Anforderungen (I2S-DMA-Buffer via MALLOC_CAP_DMA, FreeRTOS-Task-Stacks)
# bleiben intern erzwungen und sind von diesem Wert unberührt — alles andere
# (TLS, Webserver, generische Buffer) geht ab jetzt standardmäßig auf PSRAM
# statt Subsystem für Subsystem einzeln umgezogen werden zu müssen (Refs #191)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
# Reserve für Fälle, in denen internes Memory zwingend gebraucht wird (DMA,
# Task-Stacks) — entspricht dem bisherigen impliziten IDF-Default, hier nur
# explizit dokumentiert
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Audio
CONFIG_HANNAH_AUDIO_SAMPLE_RATE=16000
CONFIG_HANNAH_AUDIO_FRAME_MS=30
CONFIG_HANNAH_VOLUME_DEFAULT=80
CONFIG_HANNAH_VOLUME_STEP=10
CONFIG_HANNAH_SPK_I2S_PORT=1

# Wake-Word (standardmäßig deaktiviert → PTT-Modus)
CONFIG_HANNAH_WAKEWORD_ENABLED=y
CONFIG_HANNAH_WAKEWORD_THRESHOLD=75
CONFIG_HANNAH_VAD_SILENCE_MS=1500
CONFIG_HANNAH_VAD_WEBRTC_AGGRESSIVENESS=3
CONFIG_HANNAH_TFLITE_ARENA_KB=128

# Netzwerk
CONFIG_HANNAH_HEARTBEAT_INTERVAL_S=10
CONFIG_HANNAH_WIFI_MAX_RETRY=10
CONFIG_HANNAH_UDP_LISTEN_PORT=7776

# lwIP — UDP-Mailbox groß genug für TTS-Burst
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
# DHCP-NTP (Option 42) — für SNTP server_from_dhcp; Slot 0=DHCP, Slot 1=pool.ntp.org
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# Console über UART0 (TXD0/RXD0)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# OTA Rollback — bei fehlgeschlagenem Boot automatisch auf vorherige Partition
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Bluetooth / NimBLE (BLE passive scanner)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# NimBLE-Host-Heap in PSRAM auslagern — entlastet knappen internen RAM (AES/I2S-DMA, WiFi mgmt-frames)
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# Nur Observer-Rolle (passiver Scanner) — Connection/GATT/SMP-Code+RAM entfällt
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n

# Status-LED
CONFIG_HANNAH_STATUS_LED_ENABLED=y
CONFIG_HANNAH_STATUS_LED_GPIO=18

# Task-Watchdog (TWDT) — bislang lief er nur passiv mit (Default-Idle-Task-
# Überwachung, reiner Log-Warn ohne Konsequenz). Jetzt löst ein Timeout
# tatsächlich einen Reset aus; heartbeat_task() subscribt sich zusätzlich
# selbst (siehe hannah_net.c) und hebt dafür das Timeout passend an (Refs #86)
CONFIG_ESP_TASK_WDT_PANIC=y

# Core Dump (Refs #280) — Panic-Neustarts hatten bisher keinen Backtrace.
# ESP-IDF schreibt Register+Stack-Trace jetzt automatisch in die dedizierte
# "coredump"-Partition (siehe partitions.csv). Kein Upload vom ESP aus —
# Abruf ausschließlich per Pull über GET /debug/coredump, Dekodierung
# offline via espcoredump.py + passendem .elf.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# ESP-IDFs esp_flash_erase_region()/esp_flash_write() aborten per Default
# hart, sobald die Zieladresse in Bootloader/Partitionstabelle/laufende
# App-Partition fällt (spi_flash/Kconfig: SPI_FLASH_DANGEROUS_WRITE,
# Default ABORTS) — genau das braucht apply_partition_table_update_if_needed()
# (main.c, #280) aber bewusst, um die Partitionstabelle selbst umzuschreiben.
# Live auf echter Hardware reproduziert (Refs #282-Folgefund): jeder
# Selfupdate-Versuch abortete sofort in esp_flash_erase_region(), CI hatte
# das nie gefangen (kompiliert nur, kein Hardware-Boot). ALLOWED statt FAILS,
# weil der Schreibvorgang tatsächlich gelingen soll — die bestehende
# Erase/Write/Readback-Schleife mit 3 Versuchen (main.c) bleibt die
# eigentliche Absicherung gegen einen wirklich fehlgeschlagenen Schreibzugriff.
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
